app/controllers/services_controller.rb

SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", :id]]
---
  def show
    @service = Service.find(params[:id])